<?php

return [
    'messages' => [
        'create' => [
            'success' => 'сообщение успешно отправлено',
            'fail' => 'не удалось отправить сообщение'
        ]
    ],
    'admin' => [
        'themes' => [
            'create' => [
                'success' => 'тема добавлена',
                'fail' => 'не удалось сохранить изменения'
            ],
            'update' => [
                'success' => 'данные обновлены',
                'fail' => 'не удалось сохранить изменения'
            ],
            'delete' => [
                'success' => 'тема удалена',
                'fail' => 'не удалось удалить тему'
            ]
        ],
        'questions' => [
            'create' => [
                'success' => 'данные обновлены',
                'fail' => 'не удалось сохранить изменения'
            ],
            'delete' => [
                'success' => 'вопрос удалён',
                'fail' => 'не удалось удалить вопрос'
            ]
        ]
    ]
];
