<?php

return [
    'messages' => [
        'create' => [
            'success' => 'сообщение успешно отправлено',
            'fail' => 'не удалось отправить сообщение'
        ],
        'update' => [
            'success' => 'данные обновлены',
            'fail' => 'не удалось обновить данные'
        ]
    ],
    'account' => [
        'update' => [
            'success' => 'данные профиля обновлены',
            'fail' => 'не удалось сохранить изменения'
        ]
    ],
    'themes' => [
        'update' => [
            'success' => 'результат записан',
            'fail' => 'не удалось обновить данные'
        ],
        'create' => [
            'success' => 'авторизуйтесь для записи результатов',
            'fail' => 'не удалось обновить данные'
        ]
    ],
    'admin' => [
        'themes' => [
            'create' => [
                'success' => 'тема добавлена',
                'fail' => 'не удалось сохранить изменения'
            ],
            'update' => [
                'success' => 'данные обновлены',
                'fail' => 'не удалось сохранить изменения'
            ],
            'delete' => [
                'success' => 'тема удалена',
                'fail' => 'не удалось удалить тему'
            ]
        ],
        'questions' => [
            'create' => [
                'success' => 'данные обновлены',
                'fail' => 'не удалось сохранить изменения'
            ],
            'delete' => [
                'success' => 'вопрос удалён',
                'fail' => 'не удалось удалить вопрос'
            ]
        ],
        'messages' => [
            'update' => [
                'success' => 'статус обновлён',
                'fail' => 'не удалось сохранить изменения'
            ],
            'delete' => [
                'success' => 'обращение удалено',
                'fail' => 'не удалось удалить обращение'
            ]
        ],
        'users' => [
            'update' => [
                'success' => 'данные пользователя изменены',
                'fail' => 'не удалось сохранить изменения'
            ],
            'delete' => [
                'success' => 'пользователь удалён',
                'fail' => 'не удалось удалить пользователя'
            ]
        ],
        'admins' => [
            'update' => [
                'success' => 'данные администратора изменены',
                'fail' => 'не удалось сохранить изменения'
            ]
        ]
    ]
];
